import streamlit as st
import pandas as pd

st.title('자기소개')

st.write('## 기본 정보')
st.write('**이름**: 김동혁')
st.write('**학과**: 인공지능소프트웨어학과')
st.write('**학년**:3학년')
st.write('--')
st.write('## 이번 학기 시간표')
s = pd.DataFrame({
    '요일':['월','화','수','목','금'],
    '2교실': ['인공지능라이브러리' , '-','-','-','자연어처리'],
    '3교실': ['인공지능라이브러리' , '-','-','-','자연어처리'],
    '4교실': ['인공지능라이브러리' , '-','-','-','자연어처리'],
    '5교실': ['-' , '-','-','-','-'],
    '6교실': ['-' , '인공지능캡스톤디자인','-','인공지능서비스프로젝트','빅데이터분석프로젝트'],
    '7교실': ['-' , '인공지능캡스톤디자인','-','인공지능서비스프로젝트','빅데이터분석프로젝트'],
    '8교실': ['-' , '인공지능캡스톤디자인','-','인공지능서비스프로젝트','빅데이터분석프로젝트'],


})
st.write(s)
st.write('---')
st.write('## 관심 분야')
st.write('- 서비스')
st.write('- 채력')
st.write('---')

st.write('## 이번 학기 목표')
goals = pd.DataFrame({ 
'목표': ['졸업작품 백엔드 역활 잘하기', 'HuggingFace 활용', '살 빼기'], 
'달성률': [4, 2, 1] 
}) 
st.write(goals)
st.bar_chart(goals.set_index('목표')) 